MCTRACO/tellotalent_arduino_package/tellotalent/telloesp32/variants/mpython/pins_arduino.h
#ifndef Pins_Arduino_h
#define Pins_Arduino_h

#include <stdint.h>

#define EXTERNAL_NUM_INTERRUPTS 16
#define NUM_DIGITAL_PINS        40
#define NUM_ANALOG_INPUTS       16

#define analogInputToDigitalPin(p)  (((p)<20)?(esp32_adc2gpio[(p)]):-1)
#define digitalPinToInterrupt(p)    (((p)<40)?(p):-1)
#define digitalPinHasPWM(p)         (p < 34)

typedef unsigned char uint8_t;

static const uint8_t LED_BUILTIN = 2;
#define BUILTIN_LED  LED_BUILTIN // backward compatibility



static const uint8_t TX = 1;
static const uint8_t RX = 3;

static const uint8_t SDA = 23;
static const uint8_t SCL = 22;

static const uint8_t SS    = 5;
static const uint8_t MOSI  = 23;
static const uint8_t MISO  = 19;
static const uint8_t SCK   = 18;

static const uint8_t A0 = 36;
static const uint8_t A1 = 39;
static const uint8_t A2 = 34;
static const uint8_t A3 = 35;
static const uint8_t A4 = 15;
static const uint8_t A5 = 35;
static const uint8_t A6 = 4;
static const uint8_t A7 = 0;
static const uint8_t A8 = 2;
static const uint8_t A9 = 13;
static const uint8_t A10 = 12;
static const uint8_t A11 = 14;
static const uint8_t A12 = 27;
static const uint8_t A13 = 25;
static const uint8_t A14 = 26;



static const uint8_t D0 = 3;
static const uint8_t D1 = 1;
static const uint8_t D2 = 25;
static const uint8_t D3 = 26;
static const uint8_t D4 = 27;
static const uint8_t D5 = 9;
static const uint8_t D6 = 10;
static const uint8_t D7 = 13;
static const uint8_t D8 = 5;
static const uint8_t D9 = 2;
static const uint8_t D10 = 0;

static const uint8_t T0 = 4;
static const uint8_t T1 = 0;
static const uint8_t T2 = 2;
static const uint8_t T3 = 15;
static const uint8_t T4 = 13;
static const uint8_t T5 = 12;
static const uint8_t T6 = 14;
static const uint8_t T7 = 27;
static const uint8_t T8 = 33;
static const uint8_t T9 = 32;

static const uint8_t DAC1 = 25;
static const uint8_t DAC2 = 26;


static const uint8_t P0 = 33;
static const uint8_t P1 = 32;
static const uint8_t P2 = 35;
static const uint8_t P3 = 34;
static const uint8_t P4 = 39;
static const uint8_t P5 = 0;
static const uint8_t P6 = 16;
static const uint8_t P7 = 17;
static const uint8_t P8 = 26;
static const uint8_t P9 = 25;
static const uint8_t P10 = 36;
static const uint8_t P11 = 2;
static const uint8_t P13 = 18;
static const uint8_t P14 = 19;
static const uint8_t P15 = 21;
static const uint8_t P16 = 5;
static const uint8_t P19 = 22;
static const uint8_t P20 = 23;

static const uint8_t P23 = 27;
static const uint8_t P24 = 14;
static const uint8_t P25 = 12;
static const uint8_t P26 = 13;
static const uint8_t P27 = 15;
static const uint8_t P28 = 4;

static const uint8_t P_P = 27;
static const uint8_t P_Y = 14;
static const uint8_t P_T = 12;
static const uint8_t P_H = 13;
static const uint8_t P_O = 15;
static const uint8_t P_N = 4;

static int8_t pins_remap_esp32[] = {33, 32, 35, 34, 39, 0, 16, 17, 26, 25,
                    36,  2, -1, 18, 19, 21, 5, -1, -1, 22,
                    23,  -1, -1,27, 14, 12, 13, 15, 4};

#endif /* Pins_Arduino_h */
